---
kind: property
id: P:Autodesk.Revit.DB.UnitTypeId.General
source: html/c03d469f-be72-4519-8595-8919ab394264.htm
---
# Autodesk.Revit.DB.UnitTypeId.General Property

General.

## Syntax (C#)
```csharp
public static ForgeTypeId General { get; }
```